jjuice_fedex/rate_service _international

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v13="http://fedex.com/ws/rate/v13" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Body>
      <v13:RateRequest>
         <v13:WebAuthenticationDetail>
            <v13:UserCredential>
               <v13:Key>pJWiO448Vp2l5Lwu</v13:Key>
               <v13:Password>MJNnRP77zoRGMarukZiEXBlsU</v13:Password>
            </v13:UserCredential>
         </v13:WebAuthenticationDetail>
         <v13:ClientDetail>
            <v13:AccountNumber>510087623</v13:AccountNumber>
            <v13:MeterNumber>118694899</v13:MeterNumber>
         </v13:ClientDetail>
         <v13:TransactionDetail>
            <v13:CustomerTransactionId>Rate a Single Package V13</v13:CustomerTransactionId>
         </v13:TransactionDetail>
         <v13:Version>
            <v13:ServiceId>crs</v13:ServiceId>
            <v13:Major>13</v13:Major>
            <v13:Intermediate>0</v13:Intermediate>
            <v13:Minor>0</v13:Minor>
         </v13:Version>
         <v13:ReturnTransitAndCommit>true</v13:ReturnTransitAndCommit>
         <v13:RequestedShipment>
            <v13:ShipTimestamp>2013-07-15T12:20:47+02:00</v13:ShipTimestamp>
            <v13:DropoffType>REGULAR_PICKUP</v13:DropoffType>
            <v13:PackagingType>YOUR_PACKAGING</v13:PackagingType>
            <v13:Shipper>
               <v13:Contact>
                  <v13:PersonName>Vyshakh Parakkat</v13:PersonName>
                  <v13:CompanyName>Parakkat</v13:CompanyName>
                  <v13:PhoneNumber>08154711</v13:PhoneNumber>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>Dubai</v13:StreetLines>
                  <v13:City>Dubai city</v13:City>
                  <v13:StateOrProvinceCode/>
<v13:PostalCode>43448</v13:PostalCode>
<v13:CountryCode>AE</v13:CountryCode> 
               </v13:Address>
            </v13:Shipper>
            <v13:Recipient>
               <v13:Contact>
                  <v13:PersonName>Jane Recipient</v13:PersonName>
                  <v13:CompanyName>XYZ Company</v13:CompanyName>
                  <v13:PhoneNumber>8005551212</v13:PhoneNumber>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>Test Recipient Line 1</v13:StreetLines>
                  <v13:City>Ponnani</v13:City>
                  <v13:StateOrProvinceCode/>
                  <v13:PostalCode>679577</v13:PostalCode>
                  <v13:CountryCode>IN</v13:CountryCode>
               </v13:Address>
            </v13:Recipient>
            <v13:CustomsClearanceDetail>
               <v13:DutiesPayment>
                  <v13:PaymentType>SENDER</v13:PaymentType>
                  <v13:Payor>
                   <v13:ResponsibleParty>
                     <v13:AccountNumber>510087623</v13:AccountNumber>
                     </v13:ResponsibleParty>
                  </v13:Payor>
               </v13:DutiesPayment>
               <v13:Commodities>
                  <v13:Name>Mobile phone</v13:Name>
                  <v13:NumberOfPieces>1</v13:NumberOfPieces>
                  <v13:Description>TELEPHONE SETS, 
                  INCLUDING TELEPHONES FOR CELLULAR NETWORKS OR FOR OTHER WIRELESS NETWORKS.
                  OTHER APPARATUS FOR THE TRANSMISSION OR RECEPTION OF VOICE, 
                  IMAGES OR OTHER DATA, INCLUDING APPARATUS FOR COMMUNICATION IN A WIRED 
                  OR WIRELESS NETWORK (SUCH AS A LOCAL OR WIDE AREA NETWORK), 
                  OTHER THAN TRANSMISSION OR RECEPTION APPARATUS OF HEADING 8443, 
                  8525, 8527 OR 8528 PARTS THEREOF</v13:Description>
                  <v13:CountryOfManufacture>CN</v13:CountryOfManufacture>
                  <v13:HarmonizedCode>851711100000</v13:HarmonizedCode>
                  <v13:Weight>
                     <v13:Units>KG</v13:Units>
                     <v13:Value>.5</v13:Value>
                  </v13:Weight>
                  <v13:Quantity>1</v13:Quantity>
                  <v13:QuantityUnits>PCS</v13:QuantityUnits>
                  <v13:CustomsValue>
                     <v13:Currency>EUR</v13:Currency>
                     <v13:Amount>368</v13:Amount>
                  </v13:CustomsValue>
               </v13:Commodities>
            </v13:CustomsClearanceDetail>
            <v13:SmartPostDetail/>
            <v13:BlockInsightVisibility>0</v13:BlockInsightVisibility>
            <v13:ShippingDocumentSpecification/>
            <v13:RateRequestTypes>ACCOUNT</v13:RateRequestTypes>
            <!-- Important element for EDT: -->
            <v13:EdtRequestType>ALL</v13:EdtRequestType>
            <v13:PackageCount>1</v13:PackageCount>
            <v13:RequestedPackageLineItems>
               <v13:SequenceNumber>1</v13:SequenceNumber>
               <v13:GroupPackageCount>1</v13:GroupPackageCount>
               <v13:Weight>
                  <v13:Units>KG</v13:Units>
                  <v13:Value>0.5</v13:Value>
               </v13:Weight>
               <v13:Dimensions>
                  <v13:Length>12</v13:Length>
                  <v13:Width>8</v13:Width>
                  <v13:Height>6</v13:Height>
                  <v13:Units>CM</v13:Units>
               </v13:Dimensions>
            </v13:RequestedPackageLineItems>
         </v13:RequestedShipment>
      </v13:RateRequest>
   </soapenv:Body>
</soapenv:Envelope>
